accstarkam.ОбменМагистральБП/src/InformationRegisters/МС_НаименованиеНоменклатуры/МС_НаименованиеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_НаименованиеНоменклатуры</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

accstarkam.ОбменМагистральБП/src/InformationRegisters/МС_НаименованиеНоменклатуры/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Актуализировать(Команда)
	АктуализироватьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьВДругуюБазу(Команда)
	ОтправитьВДругуюБазуНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОтправитьВДругуюБазуНаСервере()
	МС_МодульОбменаВызовСервера.ВыгрузитьВсюНоменклатуру();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АктуализироватьНаСервере()
	
	Набор = РегистрыСведений.МС_НаименованиеНоменклатуры.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Набор.Загрузить(РезультатЗапроса );
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти
